import matplotlib.pyplot as plt

# Orac-mini-3B
orac_x = [3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30]
accuracy = [7.7638,6.8641,6.3287,6.4878,6.2785,6.1925,6.1329,6.2319,6.1245,6.0435,6.053,6.1812,6.0781,6.2257,6.3308,6.2904,6.1675,6.2279,6.2691,6.2252,6.1744,6.1373,6.0965,6.3596,6.2253,6.1443,6.3193,6.4512]
sim = [0.999984205,0.999976873,0.999833107,0.99989146,0.999867916,0.999839664,0.999797821,0.999771774,0.999714017,0.999695122,0.99968493,0.999560535,0.999398291,0.999105036,0.998794138,0.998837948,0.998708665,0.998284578,0.998247862,0.998136222,0.998093367,0.998344064,0.997957051,0.998258948,0.997934461,0.997656405,0.996828198,0.996472776]
ffn = [8.011885643,6.874820709,7.124336243,4.935425758,4.531742573,4.997209549,3.835808039,3.870806217,3.800019026,5.791165352,4.232974529,5.099052429,4.755465031,5.727694511,7.960682392,6.304388523,6.887262344,8.053129196,7.011469364,6.334543705,6.326967716,5.922649384,5.679967403,5.37325716,5.573583126,5.209730625,4.533771992,4.776257038]

# 创建图形
plt.figure(figsize=(6, 5))

# 绘制三条线
plt.plot(orac_x, accuracy, label='Accuracy', marker='o', color='#004586')  # 添加标记点
plt.plot(orac_x, sim, label='IO Similarity', marker='s', color='#FF420E')  # 添加标记点
plt.plot(orac_x, ffn, label='Gradient', marker='^', color='#FFD320')  # 添加标记点

plt.rcParams["font.family"] = "Arial"
# plt.tick_params(axis='both', labelsize=10)  # 'both' 表示同时设置 x 轴和 y 轴的标尺字体大小

# 添加标题和标签
# plt.title('sample')
plt.xlabel('Layer', fontsize=24)
plt.ylabel('Importance', fontsize=24)

plt.xticks(fontsize=20)
plt.yticks(fontsize=20)

# 添加图例
plt.legend(loc='lower right', bbox_to_anchor=(1, 0.1), fontsize=20)

# 显示网格
# plt.grid(True)
plt.tight_layout()
# 显示图形
# plt.show()
plt.savefig('pics/acc-simi-ffn.pdf', format='pdf', bbox_inches='tight', pad_inches=0.26)
